# WireMaterial Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireType..::..WireMaterial Property
WireType Class See Also
---
The material type of the wire type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireMaterialType WireMaterial { get; set; }
```

Visual Basic
---
```text
Public Property WireMaterial As WireMaterialType
	Get
	Set
```

Visual C++
---
```text
public:
property WireMaterialType^ WireMaterial {
	WireMaterialType^ get ();
	void set (WireMaterialType^ value);
}
```

# See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace